# People Report Data

In [8]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
#format: [DB_FLAVOR]+[DB_PYTHON_LIBRARY]://[USERNAME]:[PASSWORD]@[DB_HOST]:[PORT]/[DB_NAME]
engine = create_engine('mysql+mysqlconnector://cnguyen:Imq2MPSzsF5wdd8fBGA@hr-api-production-replica.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/humi')

In [2]:
engine_2 = create_engine('mysql+mysqlconnector://ili:f9FqFe93htPT13nzx@humi-data-agg.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/test')

## Background info

### companies live numbers

In [3]:
Total_company_query = "select id, created_at,locked_at,deleted_at \
from `companies` where deleted_at is null"
companies = pd.read_sql_query(Total_company_query, con=engine)

In [4]:
companies = companies.astype({'locked_at':'datetime64'})

In [5]:
companies_2019 = companies[companies['created_at']<'2019-12-31 23:59:59']

In [6]:
companies_2019.loc[((companies_2019['locked_at'].isna())|
                   (companies_2019['locked_at']>'2019-12-31')),"live data"] = True
companies_2019 = companies_2019[companies_2019['live data'] == True]
companies_2019

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

       id          created_at  locked_at deleted_at live data
0       2 2018-05-14 15:24:27        NaT       None      True
3       8 2018-05-28 19:55:32        NaT       None      True
4       9 2018-05-30 14:24:17        NaT       None      True
5      10 2018-05-30 19:44:21 2020-03-06       None      True
6      11 2018-05-31 19:38:00        NaT       None      True
..    ...                 ...        ...        ...       ...
580  1113 2019-12-20 15:29:25 2020-11-24       None      True
581  1114 2019-12-20 17:38:50        NaT       None      True
582  1116 2019-12-23 14:47:11 2021-05-17       None      True
583  1117 2019-12-23 21:22:32        NaT       None      True
584  1118 2019-12-30 17:26:23 2021-01-26       None      True

[533 rows x 5 columns]

In [26]:
companies_2020 = companies[companies['created_at']<'2020-12-31 23:59:59']

companies_2020.loc[(companies_2020['locked_at'].isna()|
                   (companies_2020['locked_at']>'2020-12-31')),"live data"] = True
companies_2020 = companies_2020[companies_2020['live data'] == True]
companies_2020

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

        id          created_at locked_at deleted_at live data
0        2 2018-05-14 15:24:27       NaT       None      True
3        8 2018-05-28 19:55:32       NaT       None      True
4        9 2018-05-30 14:24:17       NaT       None      True
6       11 2018-05-31 19:38:00       NaT       None      True
7       12 2018-06-01 15:45:51       NaT       None      True
...    ...                 ...       ...        ...       ...
1248  1922 2020-12-23 15:31:06       NaT       None      True
1249  1925 2020-12-23 18:39:10       NaT       None      True
1250  1927 2020-12-31 17:53:17       NaT       None      True
1251  1928 2020-12-31 19:27:00       NaT       None      True
1252  1929 2020-12-31 20:01:09       NaT       None      True

[1115 rows x 5 columns]

In [24]:
companies_2021 = companies[companies['created_at']<'2021-12-31 23:59:59']

companies_2021.loc[(companies_2021['locked_at'].isna())|
                   (companies_2021['locked_at']>'2021-12-31'),"live data"] = True
companies_2021 = companies_2021[companies_2021['live data'] == True]
companies_2021

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

        id          created_at locked_at deleted_at live data
0        2 2018-05-14 15:24:27       NaT       None      True
3        8 2018-05-28 19:55:32       NaT       None      True
4        9 2018-05-30 14:24:17       NaT       None      True
6       11 2018-05-31 19:38:00       NaT       None      True
7       12 2018-06-01 15:45:51       NaT       None      True
...    ...                 ...       ...        ...       ...
1865  2605 2021-07-14 18:27:21       NaT       None      True
1866  2606 2021-07-16 13:30:57       NaT       None      True
1867  2610 2021-07-16 13:51:47       NaT       None      True
1868  2611 2021-07-16 14:35:53       NaT       None      True
1869  2612 2021-07-16 14:57:12       NaT       None      True

[1605 rows x 5 columns]

### employee live numbers and gender distribution

In [ ]:
# deleted employees belong to either churned companies or bad record, need to join companies dataset 
#and eliminate bad records

In [15]:
employees_query = "select id, company_id, hired_at, terminated_on, deleted_at, legal_sex, employment_type from employees where hired_at != '3-01-03 00:00:00' \
and hired_at != '0001-01-20 00:00:00' and hired_at != '0001-08-19 21:54:51' and hired_at != '0021-07-08 05:17:32' and hired_at != '0201-09-01 00:00:00'"
employees = pd.read_sql_query(employees_query, con=engine)

In [16]:
company_bad_re_query = "select id as company_id, deleted_at as c_deleted from companies where deleted_at is not null"
company_bad_re = pd.read_sql_query(company_bad_re_query,con=engine)

In [17]:
employees = employees.merge(company_bad_re, how="left",on="company_id")

In [18]:
employees = employees[employees['c_deleted'].isna()]

In [19]:
#2018 live employees
employees_2018 = employees[employees['hired_at']<'2018-12-31 23:59:59']

employees_2018.loc[((employees_2018['terminated_on'].isna())&(employees_2018['deleted_at'].isna())|
                   (employees_2018['terminated_on']>'2018-12-31 23:59:59')
                   |(employees_2018['deleted_at']>'2018-12-31 23:59:59')),"live data"] = True
employees_2018 = employees_2018[employees_2018['live data'] == True]
employees_2018

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,id,company_id,hired_at,terminated_on,deleted_at,legal_sex,employment_type,c_deleted,live data
0,1,2,2018-04-01 00:00:00,NaT,NaT,M,full-time,NaT,True
178,179,2,2018-05-16 00:00:00,NaT,NaT,M,full-time,NaT,True
189,190,8,2017-03-06 00:00:00,2019-11-22,NaT,F,full-time,NaT,True
197,198,2,2018-05-28 00:00:00,NaT,NaT,M,full-time,NaT,True
199,200,2,2018-05-29 00:00:00,NaT,NaT,M,full-time,NaT,True
...,...,...,...,...,...,...,...,...,...
90179,92228,2598,2017-11-01 00:00:00,NaT,NaT,None,full-time,NaT,True
90180,92229,2598,2013-03-04 00:00:00,NaT,NaT,None,full-time,NaT,True
90184,92233,2598,2018-03-05 00:00:00,NaT,NaT,None,full-time,NaT,True
90189,92238,2598,2017-01-09 00:00:00,NaT,NaT,None,full-time,NaT,True
90212,92262,2503,2015-12-15 05:00:00,NaT,NaT,F,full-time,NaT,True

In [20]:
fulltime_employees_2018 = employees_2018[employees_2018['employment_type'] == 'full-time']
fulltime_employees_2018

,id,company_id,hired_at,terminated_on,deleted_at,legal_sex,employment_type,c_deleted,live data
0,1,2,2018-04-01 00:00:00,NaT,NaT,M,full-time,NaT,True
178,179,2,2018-05-16 00:00:00,NaT,NaT,M,full-time,NaT,True
189,190,8,2017-03-06 00:00:00,2019-11-22,NaT,F,full-time,NaT,True
197,198,2,2018-05-28 00:00:00,NaT,NaT,M,full-time,NaT,True
199,200,2,2018-05-29 00:00:00,NaT,NaT,M,full-time,NaT,True
...,...,...,...,...,...,...,...,...,...
90179,92228,2598,2017-11-01 00:00:00,NaT,NaT,None,full-time,NaT,True
90180,92229,2598,2013-03-04 00:00:00,NaT,NaT,None,full-time,NaT,True
90184,92233,2598,2018-03-05 00:00:00,NaT,NaT,None,full-time,NaT,True
90189,92238,2598,2017-01-09 00:00:00,NaT,NaT,None,full-time,NaT,True
90212,92262,2503,2015-12-15 05:00:00,NaT,NaT,F,full-time,NaT,True

In [21]:
# 2018 employee gender distribution
employees_2018_gender = employees_2018.dropna(subset=['legal_sex'])
employees_2018_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex   size
0         F  10188
1         M  12318
2         P   1509
3         X      5

In [54]:
#2019 live employees

employees_2019 = employees[employees['hired_at']<'2019-12-31 23:59:59']

employees_2019.loc[((employees_2019['terminated_on'].isna())&(employees_2019['deleted_at'].isna())|
                   (employees_2019['terminated_on']>'2019-12-31 23:59:59')
                   |(employees_2019['deleted_at']>'2029-12-31 23:59:59')),"live data"] = True
employees_2019 = employees_2019[employees_2019['live data'] == True]
employees_2019

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,id,company_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,live data
0,1,2,2018-04-01,NaT,NaT,M,NaT,True
178,179,2,2018-05-16,NaT,NaT,M,NaT,True
197,198,2,2018-05-28,NaT,NaT,M,NaT,True
199,200,2,2018-05-29,NaT,NaT,M,NaT,True
200,201,9,2014-11-24,2020-07-14,NaT,F,NaT,True
...,...,...,...,...,...,...,...,...
88686,90734,2605,2013-09-01,NaT,NaT,None,NaT,True
88688,90736,2605,2019-09-01,NaT,NaT,None,NaT,True
88690,90738,2605,2019-09-01,NaT,NaT,None,NaT,True
88692,90740,2605,2008-06-04,NaT,NaT,None,NaT,True
88696,90744,2605,2015-05-01,NaT,NaT,None,NaT,True

In [55]:
# 2019 employee gender distribution
employees_2019_gender = employees_2019.dropna(subset=['legal_sex'])
employees_2019_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex   size
0         F  13981
1         M  16582
2         P   1726
3         X      7

In [57]:
#2020 live employees

employees_2020 = employees[employees['hired_at']<'2020-12-31 23:59:59']

employees_2020.loc[((employees_2020['terminated_on'].isna())&(employees_2020['deleted_at'].isna())|
                   (employees_2020['terminated_on']>'2020-12-31 23:59:59')
                   |(employees_2020['deleted_at']>'2020-12-31 23:59:59')),"live data"] = True
employees_2020 = employees_2020[employees_2020['live data'] == True]
employees_2020

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,id,company_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,live data
0,1,2,2018-04-01 00:00:00,NaT,NaT,M,NaT,True
178,179,2,2018-05-16 00:00:00,NaT,NaT,M,NaT,True
197,198,2,2018-05-28 00:00:00,NaT,NaT,M,NaT,True
199,200,2,2018-05-29 00:00:00,NaT,NaT,M,NaT,True
202,203,11,2008-01-08 00:00:00,NaT,NaT,F,NaT,True
...,...,...,...,...,...,...,...,...
88688,90736,2605,2019-09-01 00:00:00,NaT,NaT,None,NaT,True
88690,90738,2605,2019-09-01 00:00:00,NaT,NaT,None,NaT,True
88692,90740,2605,2008-06-04 00:00:00,NaT,NaT,None,NaT,True
88696,90744,2605,2015-05-01 00:00:00,NaT,NaT,None,NaT,True
88709,90759,363,2020-01-01 05:00:00,NaT,NaT,None,NaT,True

In [58]:
# 2020 employee gender distribution
employees_2020_gender = employees_2020.dropna(subset=['legal_sex'])
employees_2020_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex   size
0         F  17612
1         M  20906
2         P   1697
3         X     10

In [59]:
#2021 live employees

employees_2021 = employees[employees['hired_at']<'2021-12-31 23:59:59']

employees_2021.loc[((employees_2021['terminated_on'].isna())&(employees_2021['deleted_at'].isna())|
                   (employees_2021['terminated_on']>'2021-12-31 23:59:59')
                   |(employees_2021['deleted_at']>'2021-12-31 23:59:59')
                   ),"live data"] = True
employees_2021 = employees_2021[employees_2021['live data'] == True]
employees_2021

/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1599: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = infer_fill_value(value)
/Users/irisli/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

,id,company_id,hired_at,terminated_on,deleted_at,legal_sex,c_deleted,live data
0,1,2,2018-04-01 00:00:00,NaT,NaT,M,NaT,True
178,179,2,2018-05-16 00:00:00,NaT,NaT,M,NaT,True
197,198,2,2018-05-28 00:00:00,NaT,NaT,M,NaT,True
199,200,2,2018-05-29 00:00:00,NaT,NaT,M,NaT,True
202,203,11,2008-01-08 00:00:00,NaT,NaT,F,NaT,True
...,...,...,...,...,...,...,...,...
88708,90758,2189,2021-07-24 06:00:00,NaT,NaT,None,NaT,True
88709,90759,363,2020-01-01 05:00:00,NaT,NaT,None,NaT,True
88710,90760,363,2021-01-04 05:00:00,NaT,NaT,None,NaT,True
88711,90761,363,2021-05-17 04:00:00,NaT,NaT,None,NaT,True
88712,90762,2210,2021-07-26 04:00:00,NaT,NaT,None,NaT,True

In [60]:
# 2021 employee gender distribution
employees_2021_gender = employees_2021.dropna(subset=['legal_sex'])
employees_2021_gender.groupby(["legal_sex"],as_index=False).size()

  legal_sex   size
0                1
1         F  20635
2         M  23670
3         P   1533
4         X     27

### Industry distribution is classified accourding to industry categorization on Statistics Canada

In [ ]:
all_industry = "select distinct `industry` \
from `companies` \
where `deleted_at` is null"
pd.read_sql_query(all_industry, con=engine)
## Details are in google sheet
## reference: https://www23.statcan.gc.ca/imdb/p3VD.pl?Function=getVD&TVD=1181553